In [5]:
# reference https://github.com/Data-Driven-World/d2w_notes/blob/master/Working_With_Data.ipynb
import pandas as pd
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

file_url = 'https://www.dropbox.com/s/jz8ck0obu9u1rng/resale-flat-prices-based-on-registration-date-from-jan-2017-onwards.csv?raw=1'
df = pd.read_csv(file_url)

df.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2017-01,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0
1,2017-01,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0
2,2017-01,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0
3,2017-01,ANG MO KIO,3 ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0
4,2017-01,ANG MO KIO,3 ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0

In [2]:

columns = ['town', 'block', 'resale_price']
df.loc[:, columns]

             town block  resale_price
0      ANG MO KIO   406      232000.0
1      ANG MO KIO   108      250000.0
2      ANG MO KIO   602      262000.0
3      ANG MO KIO   465      265000.0
4      ANG MO KIO   601      265000.0
...           ...   ...           ...
95853      YISHUN   326      650000.0
95854      YISHUN   360      645000.0
95855      YISHUN   326      585000.0
95856      YISHUN   355      675000.0
95857      YISHUN   277      625000.0

[95858 rows x 3 columns]

In [3]:
df.loc[df['resale_price'] > 500_000, columns]

             town block  resale_price
43     ANG MO KIO   304      518000.0
44     ANG MO KIO   646      518000.0
45     ANG MO KIO   328      560000.0
46     ANG MO KIO  588C      688000.0
47     ANG MO KIO  588D      730000.0
...           ...   ...           ...
95853      YISHUN   326      650000.0
95854      YISHUN   360      645000.0
95855      YISHUN   326      585000.0
95856      YISHUN   355      675000.0
95857      YISHUN   277      625000.0

[27233 rows x 3 columns]

In [4]:
display(df['floor_area_sqm'].describe())
display(df['lease_commence_date'].describe())

count    95858.000000
mean        97.772234
std         24.238799
min         31.000000
25%         82.000000
50%         95.000000
75%        113.000000
max        249.000000
Name: floor_area_sqm, dtype: float64

count    95858.000000
mean      1994.553934
std         13.128913
min       1966.000000
25%       1984.000000
50%       1995.000000
75%       2004.000000
max       2019.000000
Name: lease_commence_date, dtype: float64

In [7]:
	
		
df.loc['resale_price' > 500_000, :]

TypeError: '>' not supported between instances of 'str' and 'int'

In [8]:
df_tampines['resale_price_1000'] = df_tampines['resale_price'].apply(lambda price: price/1000)

NameError: name 'df_tampines' is not defined

In [10]:
df['resale_price']

0        232000.0
1        250000.0
2        262000.0
3        265000.0
4        265000.0
           ...
95853    650000.0
95854    645000.0
95855    585000.0
95856    675000.0
95857    625000.0
Name: resale_price, Length: 95858, dtype: float64

In [14]:
df.loc[:, 'resale_price']

0        232000.0
1        250000.0
2        262000.0
3        265000.0
4        265000.0
           ...
95853    650000.0
95854    645000.0
95855    585000.0
95856    675000.0
95857    625000.0
Name: resale_price, Length: 95858, dtype: float64

In [ ]:
# specify the columns of interest, replace the None
columns = ["RM", "DIS", "INDUS", "MEDV"]

# use conditions for row selector and column selector
# replace the None

df_4 = df.loc[df.index%2==0,:]

###
### YOUR CODE HERE
###

display(df_4)

In [ ]:
# Plot the histogram with the following bin edges `0, 10, 20, 30, 40, 50`.

myplot = sns.histplot(data = df['MEDV'],binrange = (0,50),bins = 6)

# Plot using boxplot
myplot = sns.boxplot(data = df['MEDV'],bins = 6)